aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio fw download seems ok.c
    mode = ( data_size >= (uint16_t) 64 ) ? SDIO_BLOCK_MODE : SDIO_BYTE_MODE;

    //ANN added below
    current_command = CYHAL_SDIO_CMD_IO_RW_EXTENDED;

   //whd_assert("Bad args", !((command == CYHAL_SDIO_CMD_IO_RW_EXTENDED) && (data == NULL)));

    if ( response != NULL )
    {
        *response = 0;
    }

    //platform_mcu_powersave_disable();

    /* Ensure the bus isn't stuck half way through transfer */
    DMA2_Stream3->CR   = 0;


restart:

    DMA_Transfer_IC = WHD_FALSE;
    SDIO->ICR = (uint32_t) 0xFFFFFFFF;
    sdio_transfer_failed = 0;
    ++attempts;

    /* Check if we've tried too many times */
    if (attempts >= (uint16_t) BUS_LEVEL_MAX_RETRIES)
    {
    	//ANN temp
        result = 1051; //WWD_SDIO_RETRIES_EXCEEDED; this prpares the exception to return, so skipped now
        WPRINT_WHD_DEBUG( ("J_WWD_SDIO_RETRIES_EXCEEDED, attmpts=%d\n",attempts) );
        goto exit;
    }
    /* Prepare the data transfer register */

    //if ( command == SDIO_CMD_53 )
    {
        //sdio_enable_bus_irq();
    	SDIO->MASK = SDIO_MASK_SDIOITIE | SDIO_MASK_CMDRENDIE | SDIO_MASK_CMDSENTIE;

        /* Dodgy STM32 hack to set the CMD53 byte mode size to be the same as the block size */

        if ( mode == SDIO_BYTE_MODE )
        {
            block_size = find_optimal_block_size( data_size );
            if ( block_size < SDIO_512B_BLOCK )
            {
                argument = ( argument & (uint32_t) ( ~0x1FF ) ) | block_size;
            }
            else
            {
                argument = ( argument & (uint32_t) ( ~0x1FF ) );
            }
        }
        //ANN temp added below.
        else
        	block_size = 64;

        /* Prepare the SDIO for a data transfer */
        current_transfer_direction = direction;
        sdio_prepare_data_transfer( direction, block_size, (uint8_t*) data, data_size );

        /* Send the command */
        SDIO->ARG = argument;
        SDIO->CMD = (uint32_t) ( CYHAL_SDIO_CMD_IO_RW_EXTENDED | SDIO_RESPONSE_SHORT | SDIO_WAIT_NO | SDIO_CPSM_ENABLE );


        do
        {
        	k_msleep(5);

        }while(DMA_Transfer_IC == WHD_FALSE);

 /*       if ( DMA_Transfer_IC == WHD_TRUE )
		{
			goto restart;
		}
*/
 /*        Wait for the whole transfer to complete
        sem_count = k_sem_count_get(&sdio_transfer_finished_semaphore);
        WPRINT_WHD_DEBUG( ("J_sem_count = %d\n",sem_count) );

       // result = cy_rtos_semaphore_get( &sdio_transfer_finished_semaphore, (uint32_t) 50 );
        result = k_sem_take(&sdio_transfer_finished_semaphore, k_timeout);
        status = error_converter(status_internal);

               if (k_is_in_isr() && (status_internal == -EBUSY))
               {
                   status = CY_RSLT_SUCCESS;
               }
     //   sem_count++;

        WPRINT_WHD_DEBUG( ("J_semaphore_result = %d\n",result) );

        sem_count = k_sem_count_get(&sdio_transfer_finished_semaphore);
        WPRINT_WHD_DEBUG( ("J_sem_count = %d\n",sem_count) );

        WPRINT_WHD_DEBUG( ("J_semaphore_result = %d\n",result) );
        //WPRINT_WHD_DEBUG( ("J_sem_count = %d\n",sem_count) );

        if ( result != WHD_SUCCESS )
        {
        	WPRINT_WHD_INFO( ("J_semaphore failed\n") );
            goto exit;
        }*/

        if ( sdio_transfer_failed == WHD_TRUE )
        {
            goto restart;
        }

        /* Check if there were any SDIO errors */
        if ( ( SDIO->STA & ( SDIO_STA_DTIMEOUT | SDIO_STA_CTIMEOUT ) ) != 0 )
        {
            goto restart;
        }
        else if ( ( ( SDIO->STA & ( SDIO_STA_CCRCFAIL | SDIO_STA_DCRCFAIL | SDIO_STA_TXUNDERR | SDIO_STA_RXOVERR ) ) != 0 ) )
        {
           // wiced_assert( "SDIO communication failure", 0 );
            goto restart;
        }

         /* Wait till complete */
        loop_count = (uint32_t) SDIO_TX_RX_COMPLETE_TIMEOUT_LOOPS;
        do
        {
            loop_count--;
            if ( loop_count == 0 || ( ( SDIO->STA & SDIO_ERROR_MASK ) != 0 ) )
            {
                goto restart;
            }
        } while ( ( SDIO->STA & ( SDIO_STA_TXACT | SDIO_STA_RXACT ) ) != 0 );

        if ( direction == BUS_READ )
        {
            memcpy( data, dma_data_source, (size_t) user_data_size );
        }
    }

	    if ( response != NULL )
    {
        *response = SDIO->RESP1;
    }
    result = WHD_SUCCESS;

exit:
    //platform_mcu_powersave_enable();
    SDIO->MASK = SDIO_MASK_SDIOITIE;
    return result;

}
//#endif
/***************************************************************************************************
 * cyhal_sdio_register_callback
 **************************************************************************************************/
void cyhal_sdio_register_callback(cyhal_sdio_t* obj, cyhal_sdio_event_callback_t callback,
                                  void* callback_arg)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != callback);

    /* Store callback info */
    obj->callback     = (void*)callback;
    obj->callback_arg = callback_arg;
}


/***************************************************************************************************
 * cyhal_sdio_enable_event
 **************************************************************************************************/
void cyhal_sdio_enable_event(cyhal_sdio_t* obj, cyhal_sdio_event_t event, uint8_t intr_priority,
                             bool enable)
{
    (void)intr_priority;
    if (enable)
    {
        __HAL_SD_ENABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        obj->irq |= (uint32_t)event;
    }
    else
    {
        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        obj->irq &= ~(uint32_t)event;
    }
}

ISR_DIRECT_DECLARE(stm32_cyhal_dma2_irq_handler)
{
    whd_result_t result;

    DMA_Transfer_IC = WHD_TRUE;

    /* Clear interrupt */
    DMA2->LIFCR = (uint32_t) (0x3F << 22);

    //result = host_rtos_set_semaphore( &sdio_transfer_finished_semaphore, WHD_TRUE );
    //result = cy_rtos_semaphore_set( &sdio_transfer_finished_semaphore );

/*    if (&sdio_transfer_finished_semaphore == NULL)
    {
    	result = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Give a semaphore
        k_sem_give(&sdio_transfer_finished_semaphore);
    }*/


