aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio fw download seems ok.c
//    sem_count--;

    //WPRINT_WHD_DEBUG( ("J_semaphore = %d\n",result) );

    /* check result if in debug mode */
     //WPRINT_WHD_DEBUG( "failed to set dma semaphore", result == WHD_SUCCESS );

    /*@-noeffect@*/
   // (void) result; /* ignore result if in release mode */
    /*@+noeffect@*/
}

/***************************************************************************************************
 * stm32_cyhal_sdio_irq_handler
 **************************************************************************************************/
//void stm32_cyhal_sdio_irq_handler(void)
ISR_DIRECT_DECLARE(stm32_cyhal_sdio_irq_handler)
{
#if defined (WICED)
	uint32_t intstatus = SDIO->STA;

	    //WHD_BUS_STATS_INCREMENT_VARIABLE( sdio_intrs );
	#if defined(STM32F412xG)
	    if (current_command == SDIO_CMD_5)
	        SDIO->ICR = SDIO_ICR_CCRCFAILC;
	#endif
	    if ( ( intstatus & ( SDIO_STA_CCRCFAIL | SDIO_STA_DCRCFAIL | SDIO_STA_TXUNDERR | SDIO_STA_RXOVERR  | SDIO_STA_STBITERR )) != 0 )
	    {
	       // WHD_BUS_STATS_INCREMENT_VARIABLE( error_intrs );
	        //wiced_assert("sdio error flagged",0);
	        sdio_transfer_failed = WHD_TRUE;
	        SDIO->ICR = (uint32_t) 0xffffffff;

	        cy_rtos_semaphore_set( &sdio_transfer_finished_semaphore );
	        //WPRINT_WHD_INFO( ("J_sdio_transfer_failed\n") );
	  //sem_count--;
	        //WPRINT_WHD_DEBUG( ("sem_count after set=%d\n",sem_count) );


	    }
	    else
	    {
	        if ((intstatus & (SDIO_STA_CMDREND | SDIO_STA_CMDSENT)) != 0)
	        {
	            if ( ( SDIO->RESP1 & 0x800 ) != 0 )
	            {
	                sdio_transfer_failed = WHD_TRUE;
	                cy_rtos_semaphore_set( &sdio_transfer_finished_semaphore );
	                //WPRINT_WHD_DEBUG( ("sdio_transfer_failed\n") );
	       //sem_count--;
	                //WPRINT_WHD_DEBUG( ("sem_count after set=%d\n",sem_count) );
	            }
	            else if (current_command == CYHAL_SDIO_CMD_IO_RW_EXTENDED)
	            {
	                if (current_transfer_direction == BUS_WRITE)
	                {
	                    DMA2_Stream3->CR = DMA_MEMORY_TO_PERIPH |
	                    		DMA_CHANNEL_4 | DMA_PINC_DISABLE | DMA_MINC_ENABLE |
								DMA_PDATAALIGN_WORD | DMA_MDATAALIGN_WORD |
								DMA_NORMAL | DMA_PRIORITY_VERY_HIGH |
								DMA_MBURST_INC4 | DMA_PBURST_INC4 | DMA_SxCR_PFCTRL | DMA_SxCR_EN | DMA_SxCR_TCIE;
	                }
	                else
	                {
	                    DMA2_Stream3->CR = DMA_PERIPH_TO_MEMORY |
	                    		DMA_CHANNEL_4 | DMA_PINC_DISABLE | DMA_MINC_ENABLE |
								DMA_PDATAALIGN_WORD | DMA_MDATAALIGN_WORD |
								DMA_NORMAL | DMA_PRIORITY_VERY_HIGH |
								DMA_MBURST_INC4 | DMA_PBURST_INC4 | DMA_SxCR_PFCTRL | DMA_SxCR_EN | DMA_SxCR_TCIE;
	                }
	            }

	            /* Clear all command/response interrupts */
	            SDIO->ICR = (SDIO_STA_CMDREND | SDIO_STA_CMDSENT);
	        }

	        /* Check whether the external interrupt was triggered */
	    if ( ( intstatus & SDIO_STA_SDIOIT ) != 0 )
	        {
	            /* Clear the interrupt and then inform WICED thread */
	            SDIO->ICR = SDIO_ICR_SDIOITC;

	            whd_thread_notify_irq( );
	        }
	            /* Clear the interrupt */
	               //     __HAL_SD_CLEAR_FLAG(_cyhal_sdio_handle, SDIO_FLAG_SDIOIT);

	                    /* Mask interrupt, to be unmasked later by Tx Path */
	                //    __HAL_SD_DISABLE_IT(_cyhal_sdio_handle, SDIO_IT_SDIOIT);

	                    /* Set IRQ Flag which will be used for setting IRQ MASK back */
	                   // obj->irq |= (uint32_t)CYHAL_SDIO_CARD_INTERRUPT;


	    }
#endif //WICED

#if(0)
	if ((_cyhal_sdio_handle != NULL) &&
        (__HAL_SD_GET_FLAG(_cyhal_sdio_handle, SDIO_STA_SDIOIT) != RESET))
    {
        cyhal_sdio_t* obj = (cyhal_sdio_t*)_cyhal_sdio_handle->Context;
        ((cyhal_sdio_event_callback_t)obj->callback)(obj->callback_arg, CYHAL_SDIO_CARD_INTERRUPT);

        /* Clear the interrupt */
        __HAL_SD_CLEAR_FLAG(_cyhal_sdio_handle, SDIO_FLAG_SDIOIT);

        /* Mask interrupt, to be unmasked later by Tx Path */
        __HAL_SD_DISABLE_IT(_cyhal_sdio_handle, SDIO_IT_SDIOIT);

        /* Set IRQ Flag which will be used for setting IRQ MASK back */
        obj->irq |= (uint32_t)CYHAL_SDIO_CARD_INTERRUPT;
    }
#endif
}


/***************************************************************************************************
 * Private Functions
 **************************************************************************************************/

/***************************************************************************************************
 * _stm32_safe_divide
 **************************************************************************************************/
static uint32_t _stm32_safe_divide(uint32_t num, uint32_t denom)
{
    /* Safe divide */
    uint32_t divres;

    assert_param(num != 0u);
    assert_param(denom != 0u);
    divres = num / denom;
    if ((num % denom) >= (denom>>1))
    {
        divres++;
    }
    return divres;
}


/***************************************************************************************************
 * _stm32_sdio_enable_hw_block
 **************************************************************************************************/
static void _stm32_sdio_enable_hw_block(cyhal_sdio_t* obj)
{
    /* Disable/reset SDIO Block */
    _stm32_sdio_disable_hw_block(obj);

    /* Enable the SDIO Clock */

    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_CLK_ENABLE();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_CLK_ENABLE();
    }
    #endif
#if(0) //ifndef(WICED)
    //ANN added below
    #if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
     		 //Enable clocks for SDIO and DMA2
   			//rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_SDIOEN);
     		 //__HAL_RCC_PWR_CLK_ENABLE();

    		 //Enable the SDIO APB2 Clock
    		  //RCC_APB2PeriphClockCmd(RCC_APB2ENR_SDIOEN, ENABLE);

    		//__HAL_RCC_SDIO_CLK_ENABLE();
    	do {
    	   __IO uint32_t tmpreg;
    	   //SET_BIT(RCC->AHB2ENR, 0x00000200);
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);
    	}
    }
    #endif
#endif //if(0)


    /* Initialize SDMMC peripheral interface with default configuration */
    //(void)SDMMC_Init(obj->hsd->Instance, obj->hsd->Init);

      //obj->hsd->Init.ClockDiv = (uint32_t)0x76;

