aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio fw download seems ok.c
        /* Set the CMD53 byte mode size to be the same as the block size */
        if (arg.cmd53.block_mode == 0U)
        {
            if (_stm32_sdio_find_optimal_block_size(arg.cmd53.count) <
                _CYHAL_SDIO_DATA_BLOCK_SIZE_512B)
            {
                arg.cmd53.count = _stm32_sdio_find_optimal_block_size(arg.cmd53.count);
            }
            else
            {
                arg.cmd53.count = 0u;
            }
        }

        obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;
        obj->hsd->State     = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        obj->hsd->Instance->DCTRL = 0u;

        if (use_temp_dma_buffer)
        {
            if ((length == 0) || (length > sizeof(_temp_dma_buffer)))
            {
                obj->hsd->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_BAD_ARGUMENT;
            }

            /* Using internal buffer */
            p_dma_buffer = _temp_dma_buffer;

            /* Clean internal buffer and copy data */
            (void)memcpy((void*)_temp_dma_buffer, (void*)data, length);

            if (length != sizeof(_temp_dma_buffer))
            {
                (void)memset((void*)&((uint8_t*)_temp_dma_buffer)[length], 0,
                             sizeof(_temp_dma_buffer) - length);
            }
        }
        else
        {
            /* Use app data buffer */
            p_dma_buffer = (uint32_t*)data;
        }

        /* Maintenance D-cache for DMA buffers */
        #if defined(_CYHAL_DCACHE_MAINTENANCE)
        if (direction == CYHAL_WRITE)
        {
            SCB_CleanDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
        }
        else
        {
            /* Cache-Invalidate the output from DMA */
            SCB_InvalidateDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
        }
        #endif /* if defined(_CYHAL_DCACHE_MAINTENANCE) */

        /* DMA configuration (use single buffer) */
        //obj->hsd->Instance->IDMACTRL  = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
        //ANN: the STM32F4 variant does not support DMA under internal SDIO/SDMMC, so, need to use the specific DMA Channel.
        //Enable the DMA2 Clock

        //__HAL_RCC_DMA2_CLK_ENABLE();//ANN commented as DMA clk is enabled earlier

        //obj->hsd->Instance->IDMABASE0 = (uint32_t)p_dma_buffer;
        //DMA2_Stream3->PAR = (uint32_t)p_dma_buffer;          // peripheral base address

        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT;
        config.TransferDir = (direction == CYHAL_WRITE) ? SDIO_TRANSFER_DIR_TO_CARD :
                             SDIO_TRANSFER_DIR_TO_SDIO;
        config.TransferMode  = SDIO_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDIO_DPSM_DISABLE;
        config.DataLength    = block_size * number_of_blocks;
        config.DataBlockSize = _stm32_sdio_convert_block_size((uint16_t)block_size);

        obj->hsd->Instance->DCTRL |= SDIO_DCTRL_SDIOEN; /* SD I/O enable functions */

        /* obj->hsd->Instance->DCTRL |= (uint32_t)sdio_get_blocksize_dctrl(block_size) | bus_direction_mapping[(int)direction] |
        		SDIO_TransferMode_Block | SDIO_DPSM_Enable | (1 << 3) | (1 << 11);*/

        //(void)SDMMC_ConfigData(obj->hsd->Instance, &config);
        (void)SDIO_ConfigData(obj->hsd->Instance, &config);


        //ANN added below from WICED
#if defined(WICED)
        DMA2_Stream3->CR   = 0;
        DMA2->LIFCR        = (uint32_t) ( 0x3F << 22 );
        DMA2_Stream3->FCR  = (uint32_t) ( 0x00000021 | 4 | 3 );
        DMA2_Stream3->PAR  = (uint32_t) &SDIO->FIFO;
        DMA2_Stream3->M0AR = (uint32_t) dma_data_source;
        //DMA2_Stream3->M0AR = (uint32_t) p_dma_buffer;//ANN
        DMA2_Stream3->NDTR = dma_transfer_size/4;
#endif


//ANN commented below for sometime. Below macro does ORing with SDMMC_CMD_CMDTRANS which is for CPSM Treats command as a Data Transfer  
  // __SDMMC_CMDTRANS_ENABLE(obj->hsd->Instance);


        /* Call CMD53 (CYHAL_SDIO_CMD_IO_RW_EXTENDED) */
        result = cyhal_sdio_send_cmd(obj, direction, CYHAL_SDIO_CMD_IO_RW_EXTENDED,
                                     arg.value, response);

        /* Check error from CMD53 */
        if (result != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDMMC_STATIC_FLAGS);
            obj->hsd->State = HAL_SD_STATE_READY;
            return result;
        }

        /* Check if there were any SDIO errors */
		if ( ( SDIO->STA & ( SDIO_STA_DTIMEOUT | SDIO_STA_CTIMEOUT ) ) != 0 )
		{
			return CYHAL_SDIO_RET_CMD_TIMEOUT;
		}
		else if ( ( ( SDIO->STA & ( SDIO_STA_CCRCFAIL | SDIO_STA_DCRCFAIL | SDIO_STA_TXUNDERR | SDIO_STA_RXOVERR ) ) != 0 ) )
		{
			return CYHAL_SDIO_RET_CMD_TIMEOUT;
		}


/*
         Set polling flags
        flags = SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DATAEND |
                SDIO_FLAG_TXUNDERR | SDIO_FLAG_RXOVERR;
*/
        /* Poll on SDMMC flags */
        while ((!__HAL_SD_GET_FLAG(obj->hsd, flags)) && (timeout > 0u))
        {
            // returning ERROR code for timeout
            //HAL_Delay(1U);
            k_msleep(1);
            //K_MSEC	(1);
        	//for(int i=0;i<1000;i++);
            timeout--;
            if (timeout == 0u)
            {
                obj->hsd->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_RET_CMD_TIMEOUT;
            }
        }


        /* Check for SDMMC interrupt flags */
        if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DATAEND) != RESET)
        {
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDIO_FLAG_DATAEND);
        }
        else if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT |
                                   SDIO_FLAG_RXOVERR | SDIO_FLAG_TXUNDERR) != RESET)
        {
            /* Set Error code */
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DCRCFAIL) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DTIMEOUT) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_RXOVERR) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_TXUNDERR) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_TX_UNDERRUN;
            }
        }
        else
        {
            /* Nothing to do */
        }

        /* Set SDIO to init state */
        //ANN: please ensure the obj->hsd is pointing to correct base address of required stream/channel
        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_TXFIFOF);
//        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_TXFIFOF);
        //ANN: please ensure (STM32F4) SDIO_IT_TXFIFOF == (STM32H7) SDMMC_IT_IDMABTC. refer stm32l4xx_ll_sdmmc.h & stm32f4xx_ll_sdmmc.h

        //ANN commented below as for STM32F4
        //__SDMMC_CMDTRANS_DISABLE(obj->hsd->Instance);

        obj->hsd->Instance->DLEN     = 0;
        obj->hsd->Instance->DCTRL    = SDIO_DCTRL_SDIOEN;
        //obj->hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
        __SDIO_OPERATION_DISABLE(obj->hsd->Instance);
        obj->hsd->Instance->CMD      = 0;
        //ANN: please check if it's required to reset FIFO, if so, then do it by finding right bit.
        //obj->hsd->Instance->DCTRL   |= SDMMC_DCTRL_FIFORST;

        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(obj->hsd, SDIO_STATIC_DATA_FLAGS);

        /* Copy received data to user */
        if ((direction == CYHAL_READ) && (use_temp_dma_buffer) && (!obj->hsd->ErrorCode))
        {
            (void)memcpy((void*)data, (void*)_temp_dma_buffer, (size_t)length);
        }

        /* Set the SD state to ready to be able to start again the process */
        _cyhal_sdio_handle->State = HAL_SD_STATE_READY;

        /* This interrupt is disabled in interrupt handler so need to enable it here */
        if (0U != ((uint32_t)CYHAL_SDIO_CARD_INTERRUPT & obj->irq))
        {
            __HAL_SD_ENABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        }
    }
    else
    {
        obj->hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
        return CYHAL_SDIO_RSLT_ERR_PM_PENDING;
    }

    if (obj->hsd->ErrorCode == HAL_SD_ERROR_NONE)
    {
        result = CY_RSLT_SUCCESS;
    }
    else
    {
        result = CYHAL_SDIO_RET_NO_SP_ERRORS; /**< Non-specific error code*/
    }
    return result;
}

#endif

#pragma GCC pop_options

#if defined(__cplusplus)
}
#endif
